system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;	//This gives you the scale: 0.001 would mean all units in this file are [mm]

vertices		//list of vertices defining the geometry (x y z)
(
    (-1 -1 -1)		//This is point 0. Not 1!
    (25 -1 -1)		//This is point 1
    (25 6 -1)		//point 2
    (-1 6 -1)		//point 3
    (-1 -1 4)		//point 4
    (25 -1 4)		//point 5
    (25 6 4) 		//point 6
    (-1 6 4)		//point 7
);

blocks			//defining the block which the geometry is made out of
(
    hex (0 1 2 3 4 5 6 7) (260 70 50) simpleGrading (1 1 1)  	
//this means that the only block in the geometry is defined by vertices (0 1 2 ...), there are 100, 10 
//and 1 cells in the x, y, and z direction and that in each direction all the cells have the same length 
);

edges
(
);

patches
(
    patch maxY
        (
            (3 7 6 2)
	)
    patch minX
        (
            (0 4 7 3)
	)  
    patch maxX
        (
            (2 6 5 1)
	) 
    patch minY
        (
            (1 5 4 0)
	) 
    patch minZ
        (
            (0 3 2 1)
	)  
    patch maxZ
        (
            (4 5 6 7)
	) 
);

mergePatchParts
(
);


// ************************************************************************* //
